# System.
brew 'zsh'                        # Shell.
brew 'git'                        # Vcs.
brew 'git-flow-avh'               # Git-flow support.
brew 'tmux'                       # Temrinal multiplexer.
brew 'reattach-to-user-namespace' # Allow for pbcopy/pbpaste in tmux.
brew 'binutils'                   # Gold, nm, objdump.
brew 'most'                       # Nicer pager than less.
brew 'htop-osx'                   # Process viewer.
brew 'jq'                         # JSON parsing from shell.
brew 'mobile-shell'               # Mosh, better ssh.
brew 'watch'                      # Shell util to watch a command.
brew 'tree'                       # Nice tool to dump diectory tree.
brew 'wget'                       # Alternative to curl.
brew 'siege'                      # HTTP benchmark tool.
brew 'wrk'                        # HTTP benchmark tool.
brew 'aria2'                      # Torrent / file downloader/accelerator.
brew 'remake'                     # Makefile debugger.
brew 'gcc'                        # Compiler.
brew 'gdb'                        # Debugger.
brew 'unixodbc'                   # Odbc drivers.
brew 'coreutils'                  # Gdate & co.
brew 'asciinema'                  # Terminal recorder.
brew 'unrar'                      # Unrar tool.
brew 'xz'                         # Compression tool.
brew 'nmap'                       # Network scans.

# 3rd part services.
brew 'terraform'       # Infrastructure from files.
brew 'awscli'          # Amazon AWS.
brew 'docker-cloud'    # Docker-cloud (formerly tutum).
brew 'rancher-cli'     # Rancher.
brew 'rancher-compose' # Rancher.

# DB tools/cli.
brew 'postgresql'
brew 'mysql'
brew 'mongodb'
brew 'redis'
brew 'zookeeper'

# Editor.
brew 'emacs'
brew 'ispell'

# Golang.
brew 'go'
brew 'glide' # Vendor manager.

# Other languages/vms.
brew 'node'
brew 'python'
brew 'ruby'

# Docker.
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# Applications.
cask_args appdir: '/Applications'
tap 'caskroom/cask'              # To install apps.
tap 'caskroom/homebrew-versions' # For iterm2-nightly.
cask 'google-chrome'             # Browser.
cask 'firefox'                   # Browser.
cask 'virtualbox'                # VM Supervisor.
cask 'vagrant'                   # VM manager.
cask 'iterm2-nightly'            # Nightly for ligature font support.
cask 'slack'                     # Chat client.
cask 'skype'                     # Voip.
cask 'gpgtools'                  # GPG support.
cask 'vlc'                       # Media player.
cask 'dropbox'                   # File sharing.
cask 'google-drive'              # File sharing.
cask 'spotify'                   # Music player.
cask 'bettertouchtool'           # Window snap / macro management. Requires a license ($6.5, https://sites.fastspring.com/boastr/product/bettertouchtool).
cask 'istat-menus'               # Network / Sensor stats in the menu. Requires a license ($18, https://bjango.com/mac/istatmenus/)
cask 'tunnelblick'               # OpenVPN client.
cask 'xquartz'                   # X11.
cask 'sublime-text'              # Sublime text editor.
cask 'visual-studio-code'        # Code IDE.
cask 'handbrake'                 # Video encoding.
cask 'transmission'              # Torrent client.
cask 'screenhero'                # Screen sharing / pair programming.
cask 'daisydisk'                 # Disc space scanner.
cask 'evernote'                  # Note management.

# Fonts.
tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-awesome-terminal-fonts'

# Random.
cask 'java'       # Java suuport.
cask 'keybase'    # Keybase client.
brew 'xmlstarlet' # XML parsing on CLI.
brew 'hugo'       # Blog engine.

# Dependencies. (Optional, for `brew bundle cleanup`)
brew 'autoconf'
brew 'pcre'
brew 'gdbm'
brew 'libyaml'
brew 'readline'
brew 'openssl'
brew 'libevent'
brew 'protobuf'
brew 's-lang'
brew 'sqlite'
brew 'gmp'
brew 'isl'
brew 'pango'
brew 'librsvg'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pixman'
brew 'glib'
brew 'cairo'
brew 'jpeg'
brew 'libtiff'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'libcroco'
brew 'icu4c'
brew 'harfbuzz'
brew 'oniguruma'
brew 'libmpc'
brew 'mpfr'
