# Utils / helpers.
brew 'zsh'                        # shell.
brew 'git'                        # vcs.
brew 'tmux'                       # temrinal multiplexer.
brew 'reattach-to-user-namespace' # allow for pbcopy/pbpaste in tmux.
brew 'wget'                       # alternative to curl.
brew 'binutils'                   # gold, nm, objdump.
brew 'most'                       # nicer pager than less.
brew 'htop-osx'                   # process viewer.
brew 'jq'                         # json parsing from shell.
brew 'mobile-shell'               # mosh, better ssh.
brew 'watch'                      # shell util to watch a command.
brew 'tree'                       # nice tool to dump diectory tree.
brew 'unrar'                      # unrar tool.
brew 'terraform'                  # infrastructure from files.
brew 'siege'                      # HTTP benchmark tool.
brew 'wrk'                        # HTTP benchmark tool.
brew 'aria2'                      # torrent / file downloader/accelerator.
brew 'remake'                     # makefile debugger.
brew 'gcc'                        # Compiler.
brew 'gdb'                        # debugger.
brew 'unixodbc'                   # ODBC drivers.
brew 'coreutils'                  # gdate & co.
brew 'asciinema'                  # terminal recorder.
brew 'xz'                         # compression tool.

# 3rd part services.
brew 'awscli'
brew 'docker-cloud'
brew 'rancher-cli'
brew 'rancher-compose'

# DB tools/cli.
brew 'postgresql'
brew 'mysql'
brew 'mongodb'
brew 'redis'
brew 'zookeeper'

# Editor.
brew 'emacs'

# Golang.
brew 'go'
brew 'glide' # vendor manager.

# Other languages/vms.
brew 'node'
brew 'python'
brew 'ruby'

# Docker.
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# Applications.
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/homebrew-versions' # For iterm2-nightly.
cask 'google-chrome'
cask 'virtualbox'
cask 'iterm2-nightly'            # Nightly for ligature font support.
cask 'slack'
cask 'skype'
cask 'gpgtools'
cask 'vlc'
cask 'dropbox'
cask 'spotify'
cask 'bettertouchtool'          # Requires a license ($6.5, https://sites.fastspring.com/boastr/product/bettertouchtool).
cask 'istat-menus'              # Requires a license ($18, https://bjango.com/mac/istatmenus/)

# Fonts.
tap 'caskroom/fonts'
cask 'font-fira-code'

# Random
cask 'java'
cask 'keybase'
brew 'xmlstarlet'

# Dependencies. (Optional, for `brew bundle cleanup`)
brew 'autoconf'
brew 'pcre'
brew 'gdbm'
brew 'libyaml'
brew 'readline'
brew 'openssl'
brew 'libevent'
brew 'protobuf'
brew 's-lang'
brew 'sqlite'
brew 'gmp'
brew 'isl'
brew 'pango'
brew 'librsvg'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pixman'
brew 'glib'
brew 'cairo'
brew 'jpeg'
brew 'libtiff'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'libcroco'
brew 'icu4c'
brew 'harfbuzz'
brew 'oniguruma'
brew 'libmpc'
brew 'mpfr'
